Revit 2027 API
BuiltInFailures.StairRampFailures.LandingDepthIsLessThanRunWidthWarning Property
 Landing depth is less than run width.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LandingDepthIsLessThanRunWidthWarning { get; }
Public Shared ReadOnly Property LandingDepthIsLessThanRunWidthWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LandingDepthIsLessThanRunWidthWarning {
	FailureDefinitionId^ get ();
}
static member LandingDepthIsLessThanRunWidthWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace